Repository: wescamp/Orcish_Incursion-root
Catalog: po/*.po
Languages: hu

source: An Orcish Incursion
hu: Ork betörés

source: Fighter
hu: Harcos

source: (easiest)
hu: (legkönnyebb)

source: Lord
hu: Előljáró

source: (hardest)
hu: (legnehezebb)

source: High Lord
hu: Nagyúr

source: Defend the forests of the elves against marauding orcs, learning valuable tactics as you do so.
hu: Oltalmazd a tündék erdejét a portyázó orkoktól, miközben tovább csiszolhatod harci taktikáidat.

source: Showdown
hu: Leszámolás

source: Hint: Your enemy is well defended against attacks from the south. Use rangers to sneak through the forest and mount a surprise attack from the north.
hu: Tipp: Az ellenfél keményen felkészült a délről érkező támadások ellen. Használd a vadászaidat, hogy az erdőn átlopakodva északról meglephesd őket.

source: Defeat Rualsha-Tan
hu: Legyőzöd Rualsha-Tant

source: Death of Erlornas
hu: Erlornas elesik

source: Time runs out
hu: Túlléped a körök számát

source: My lord! We have ridden hard for five days to catch up with you! The council has deliberated, and asks you to defeat Rualsha quickly before he can muster a full invasion force.
hu: Uram! Öt napja rendületlenül vágtatunk, hogy ideérjünk! A tanács döntött, és téged bízott meg Rualsha elpusztításával, még mielőtt felállíthatna egy teljes lerohanáshoz szükséges haderőt.

source: Puny elves! My full army will be here soon, and then we will crush you. You will beg for a quick death!
hu: Hitvány tündék! Hamarosan itt lesz az egész seregem, és akkor eltiprunk titeket. A minnél gyorsabb halálért fogtok könyörögni!

source: You may slay me, Erlornas, but my people live on. They will not forget! They will persue you, and destroy you utterly... we will... we... arrgh...
hu: Engem legyőzhetsz, Erlornas, de a népem tovább fog élni. Nem fogják elfelejteni! Fel fognak téged kutatni, és csúnyán meg fogsz ezért lakolni. Mi majd... me... öö...

source: But Rualsha overestimated the will of his troops. With their leader dead, they scattered, and fled from the elves back to their homes in the far north.
hu: De Rualsha túlbecsülte csapatainak elszántságát. Vezérüket holtan látva, felbomlottak, és fejvesztve menekültek a tündék elől északi otthonaikba.

source: Assassins
hu: Orgyilkosok

source: Hint: Assassins are hard to hit, and their poison is insidious. Stay close to the villages, where poisoning can be cured, and force your enemies to attack you from the river.
hu: Tipp: Az orgyilkosokat nehéz megütni, és ráadásul alattomosan megmérgezik támadójukat. Érdemes közel maradnod a falvakhoz, ahol meggógyíthatod a megmérgezett egységeidet, és ellenfelednek a folyóból kell támadnia.

source: Defeat Gharlsa
hu: Legyőzöd Gharlsát

source: Gharlsa sees elves... yes... fresh meat, yes, yes...
hu: Gharlsa tündéket lát... igen.. friss hús, igen, igen...

source: Does that demented creature really think he can kill us... let us teach him a lesson!
hu: Ez az együgyű tényleg azt hiszi legyőzhet minket... leckéztessük csak meg!

source: Be careful... he may be more dangerous than he appears.
hu: Légy óvatos... lehet hogy veszélyesebb számunkra, mint amilyennek látszik.

source: Yes... yes... slay them, my assassins!
hu: Igen... igen... vágjátok őket, orgyilkosaim!

source: Valley of Trolls
hu: A trollok völgye

source: Hint: Trolls are very dangerous if they can attack as a group. Use the cave-mouths as bottlenecks to fight them one at a time.
hu: Tipp: A trollok nagyon veszélyesek, ha csaatba verődve indíthatnak támadást. Használd a barlangszájakat, mintha üvegek szájai lennének, hogy egyessével intézhesd el őket.

source: Defeat all enemy leaders
hu: Legyőzöd valamennyi ellenséges vezért

source: We are far from our lands, now, Erlornas, and we have driven the orcs from the forest. Why do we not return to our post?
hu: Már távol vagyunk hazánktól, Erlornas, és már kiüldöztük az orkokat ez erdőből. Miért nem térünk vissza az állásainkhoz?

source: You heard what the orcs said - this Rualsha is more than a mere marauding warlord in search of pillage. He is planning an invasion, I'm sure of it. We must gather more information about his plans before we go back.
hu: Te is hallottad, amit az orkok mondtak - ez a Rualsha több volt mint egy zsákmányra éhes portyázó hadúr. Egy inváziót tervezett, ebben biztos vagyok. Többet meg kell tudnunk ezekről a tervekről mielőtt visszatérnénk.

source: Information will do us no good if we are killed before we return with it! These mountains look like troll territory.
hu: Ezek az értesülések semmire se lesznek jók, ha szétvernek minket még mielőtt visszatérhetnénk velük! Ezek a hegyek troll területeknek látszanak.

source: Defend the Forest
hu: Az erdő megvédése

source: Hint: Elves can move fast and safely among the trees. Pick off the enemy grunts with your archers from the safety of the forest.
hu: Tipp: A tündék gyorsan és biztonságosan közlekednek az erdőben. Íjászaid az erdő oltalmából könnyen kilőhetik az ellenséges közkatonákat.

source: Defeat Urugha
hu: Legyőzöd Urughát

source: Look, Erlornas! A war party of orcs has encamped to the north. They are destroying the forest there!
hu: Nézd, Erlornas! Egy ork szabadcsapat tábort vert ott, északra. Az erdőt pusztítják arrafelé!

source: I see them... we should be able to drive them off. All the same, you had best send for reinforcements, Lomarfel.
hu: Látom őket... szerintem el tudjuk őket kergetni. Bárhogy is, az lesz a legjobb, ha küldünk erősítésért, Lomarfel.

source: Yes, sir!
hu: Igenis, uram!

source: A thousand curses on you, elfling! You will suffer... My master, Rualsha, approaches. He will wipe your people from the face of this earth!
hu: Ezer átok szálljon rátok, tündeszerzetek! Szenvedni fogtok... Mesterem, Rualsha, már úton van. El fog titeket takarítani a föld színéről!

source: Hmmm... Who is this Rualsha, I wonder? I will have to take a small exploration party north to see what is afoot there...
hu: Hmm... Vajon ki is lehet ez a Rualsha? Az lesz a legjobb, ha küldök egy kis felderítő csapatot északra, hogy kiderüljön, hogy mi folyik ott.

source: Wasteland
hu: Pusztaság

source: Hint: There are no villages in this scenario - you must use healers instead. Use hit and run tactics to weaken enemy units who cannot heal themselves.
hu: Tipp: Ezen a pályán nem találsz falvakat - ezek helyett gyógyítókat kell bevetned. Eredményes lehet a cserbenhagyásos támadás, hogy meggyengítsd a felgyógyulni nem tudó ellenséges egységeket.

source: Defeat Gnargha
hu: Legyőzöd Gnarghát

source: The foul orcs have devastated this area, destroying the trees and driving out the peaceful folk... it saddens me to see such waste.
hu: Az ostoba orkok letarolták ezt a környéket, kiírtották a fákat és elüldözték a békeszerető lakosokat... szomorú ennek a kietlen pusztaságnak a látványa.

source: Greetings, Erlornas! I am Gnargha, the brother of Urugha whom you slew but few nights ago. Know this: Lord Rualsha has permitted me to be the agent of his revenge!
hu: Üdvözlet, Erlornas! Gnargha vagyok, Urugha testvére, akit néhány napja lemészároltál. Tudd: Rualsha úr felhatalmazott, hogy végrehajtsam a bosszúját.

source: I have no quarrel with you, Gnargha, nor with your leader Rualsha - but I cannot permit you to invade our lands. Leave now, and we shall be at peace.
hu: Nincs vitás ügyem sem veled, Gnargha, sem a vezéreddel, Rualshával - de nem hagyhatom, hogy megszálljátoka mi területünket. Ha most elmész, békében távozhattok.

source: Peace?! Bah! You are weaker than I thought. Now prepare yourself for a slow and painful death!
hu: Béke?! Áá! Gyengébb vagy mint gondoltam. Készülj hosszadalmas és fájdalmas halálra!

source: Gnargha and his troops must have come down out of that valley to the north... that is where we will go next!
hu: Gnargha és csapatai minden bizonnyal onnan, az északi völgyből jöttek le... folytassuk arra utunkat!

source: Linaera the Quick
hu: Szélsebes Linaera

source: Hint: This enemy is too strong for you to defeat alone. Use mounted units, and Linaera's power of teleportation to mount hit and run attacks.
hu: Tipp: Ez az ellenfél túl erős, hogy egyedül legyőzhesd. Használj lovas egységeket, és Linaera teleportációs képességét, hogy kis, cserbenhagyásos ütéseket ejthess.

source: Defeat Krughnar
hu: Legyőzöd Krughnart

source: Death of Linaera
hu: Linaera elesik

source: We have come into the lands of the humans, Erlornas! See, there is one living in that tower to the west.
hu: Az emberek földjeihez értünk, Erlornas! Nézd, az egyik ott lakik nyugatra, abban a toronyban.

source: Help! A great army of orcs has come down from the north, and has been laying seige to my tower for weeks... we are nearly out of supplies. Our people have always been friendly to the elves - will you not assist us?
hu: Segítség! Egy nagy ork horda támadt rám északról és már hetek óta ostromolják a tornyomat... már alig maradt a készleteinkből. Népeink mindig is jó viszonyban voltak - segítenétek rajtunk?

source: Yes, of course! But... I wish to defeat the vile orcs and drive them away from our borders. Will you join us in attacking them?
hu: Igen, ez természetes! De... le akarom győzni az aljas szörnyetegeket, és messzire üldözni őket a határainktól. Segíteni fogtok a támadásban?

source: Nothing would please me better! I will place all my powers at your command.
hu: Semmi sem tenne boldogabbá! A parancsnoklatod alá helyezem minden erőnket.

source: My lord... humans cannot be trusted! They shift their allegiances with the changing of the wind!
hu: Uram... nem bízhatunk az emberekben! Mindig annak az oldalára állnak, ahonnan többet remélhetnek!

source: That may be, but I do not think this one will betray us to the orcs. And we may need her assistance, too: that is a powerful force of orcs ahead.
hu: Lehetséges, de nem hinném, hogy ez itt átállna az orkokhoz. És nekünk is szükségünk van az ő segítségükre: nagy túlerővel állnánk szemben, ha egyedül mérkőznénk meg ezzel az ork csapattal.

source: Oh no! Without Linaera's help, I cannot hope to defeat such a great force of orcs. I must return to my post and await reinforcements.
hu: Ó, nem! Linaera nélkül nem hinném, hogy le tudnánk győzni ezt az ork sereget. Vissza kell húzódnom az állásunkba, és megvárni az erősítést.

source: Thank you, Linaera. I couldn't have defeated the orcs without your help... How can I repay you?
hu: Köszönöm, Linaera. Nélküled nem sikerült volna legyőzni az orkokat... Hogyan fizethetném vissza?

source: There is one other thing... an evil power infests the swamps to the east of here. I had meant to deal with it myself, but perhaps you would like to help us once again?
hu: Van még valami... egy gonosz hatalom háborgatja az ingoványt, innen keletre. Egyedül gondoltam elintézni a dolgot, de talán egyszer még szívesen segítenél minket.

source: Very well... to the east!
hu: Nagyon jó... irány kelet!

source: A Detour through the Swamp
hu: Kitérő az ingovány felé

source: Hint: Undead are resistant to physical attack. Use mages to attack the undead, and elves to protect and support the mages.
hu: Tipp: Az élőholtak ellenállóak a fizikai támadásokkal szemben. Használj mágusokat ellenük, valamint tündékkel védd meg és támogasd őket.

source: Defeat Keremal
hu: Legyőzöd Keremalt

source: The evil spirits who have settled in this wetland have turned it into a vile bog. My apprentices and I have the power to dispell them, but you must protect us from their weapons.
hu: Az ideköltözött gonosz lelkek egy vészjósló láppá változtatták az ingoványt. A tanítványimnak és nekem megvan az erőnk, hogy kiűzzük őket, de meg kell hogy védjetek minket a fegyvereiktől.

source: All is lost! Without Linaera's help, I cannot hope to defeat these horrifying appraritions!
hu: Minden elveszett! Linaera nélkül semmi esélyünk, hogy legyőzzük ezeket a rémisztő teremtményeket!

source: Thank you, Erlornas... now I can return to my tower in peace. But I think some of my apprentices wish to follow you north in persuit of the orcs.
hu: Köszönet, Erlornas... mostmár békében visszatérhetek a tornyomba. De úgy gondolom néhány tanítványom szívesen elkísérne északra, tovább üldözni az orkokat.

source: I have always wished to see elves, and now I have fought alongside them! May I please come with you?
hu: Mindig is találkozni akartam egy tündével, és most mellettük harclhattam! Kérlek, hadd tartsak veletek!

source: Certainly... I shall be glad of your help.
hu: Persze... szívesen fogadjuk a segítségeteket.
